// 微信场景值对象 (对应微信文档)
export const wxScene = {
  '1001': '发现栏小程序主入口',
  '1005': '顶部搜索框的搜索结果页',
  '1006': '发现栏小程序主入口搜索框的搜索结果页',
  '1007': '单人聊天会话中的小程序消息卡片',
  '1008': '群聊会话中的小程序消息卡片',
  '1011': '扫描二维码',
  '1012': '长按图片识别二维码',
  '1013': '手机相册选取二维码',
  '1014': '小程序模板消息',
  '1017': '前往体验版的入口页',
  '1019': '微信钱包',
  '1020': '公众号 profile 页相关小程序列表',
  '1022': '聊天顶部置顶小程序入口',
  '1023': '安卓系统桌面图标',
  '1024': '小程序 profile 页',
  '1025': '扫描一维码',
  '1026': '附近小程序列表',
  '1027': '顶部搜索框搜索结果页「使用过的小程序」列表',
  '1028': '我的卡包',
  '1029': '卡券详情页',
  '1030': '自动化测试下打开小程序',
  '1031': '长按图片识别一维码',
  '1032': '手机相册选取一维码',
  '1034': '微信支付完成页',
  '1035': '公众号自定义菜单',
  '1036': 'App 分享消息卡片',
  '1037': '小程序打开小程序',
  '1038': '从另一个小程序返回',
  '1039': '摇电视',
  '1042': '添加好友搜索框的搜索结果页',
  '1043': '公众号模板消息',
  '1044': '带 shareTicket 的小程序消息卡片',
  '1045': '朋友圈广告',
  '1046': '朋友圈广告详情页',
  '1047': '扫描小程序码',
  '1048': '长按图片识别小程序码',
  '1049': '手机相册选取小程序码',
  '1052': '卡券的适用门店列表',
  '1053': '搜一搜的结果页',
  '1054': '顶部搜索框小程序快捷入口',
  '1056': '音乐播放器菜单',
  '1057': '钱包中的银行卡详情页',
  '1058': '公众号文章',
  '1059': '体验版小程序绑定邀请页',
  '1064': '微信连Wi-Fi状态栏',
  '1067': '公众号文章广告',
  '1068': '附近小程序列表广告',
  '1069': '移动应用',
  '1071': '钱包中的银行卡列表页',
  '1072': '二维码收款页面',
  '1073': '客服消息列表下发的小程序消息卡片',
  '1074': '公众号会话下发的小程序消息卡片',
  '1077': '摇周边',
  '1078': '连Wi-Fi成功页',
  '1079': '微信游戏中心',
  '1081': '客服消息下发的文字链',
  '1082': '公众号会话下发的文字链',
  '1084': '朋友圈广告原生页',
  '1089': '微信聊天主界面下拉',
  '1090': '长按小程序右上角菜单唤出最近使用历史',
  '1091': '公众号文章商品卡片',
  '1092': '城市服务入口',
  '1095': '小程序广告组件',
  '1096': '聊天记录',
  '1097': '微信支付签约页',
  '1099': '页面内嵌插件',
  '1102': '公众号 profile 页服务预览',
  '1103': '发现栏小程序主入口',
  '1104': '微信聊天主界面下拉'
}

// 小程序页面
export const xcxPage = {
  index: {
    id: 1,
    pageName: '首页'
  },
  personal: {
    id: 2,
    pageName: '个人中心'
  },
  pay: {
    id: 3,
    pageName: '支付结果'
  },
  landingpage: {
    id: 4,
    pageName: '落地页'
  },

  address: {
    id: 5,
    pageName: '填写收货信息'
  },
  addresschoose: {
    id: 6,
    pageName: '选择地址'
  },
  amendplan: {
    id: 7,
    pageName: '修改送水计划'
  },
  appointment: {
    id: 8,
    pageName: '临时加送'
  },

  'get-present': {
    id: 9,
    pageName: '送水领取页'
  },

  'gift-history': {
    id: 10,
    pageName: '赠送记录'
  },
  'gooddesc-images': {
    id: 11,
    pageName: '商品详情'
  },
  keep: {
    id: 12,
    pageName: '加购支架'
  },
  'line-item': {
    id: 13,
    pageName: '订单详情'
  },
  login: {
    id: 14,
    pageName: '微信授权页面'
  },
  plan: {
    id: 15,
    pageName: '送水计划'
  },
  present: {
    id: 1,
    pageName: '赠送好友'
  },

  'purchase-history': {
    id: 17,
    pageName: '购买记录'
  },

  questions: {
    id: 18,
    pageName: '常见问题'
  },

  'service-order': {
    id: 19,
    pageName: '客服分享订单页'
  },

  'shipment-history': {
    id: 20,
    pageName: '配送记录'
  },

  'shipping-address': {
    id: 21,
    pageName: '收货地址'
  },

  'shipping-details': {
    id: 22,
    pageName: '配送详情'
  },

  'update-plan': {
    id: 23,
    pageName: '修改配送时间'
  },

  'user-data': {
    id: 24,
    pageName: '个人资料'
  },

  'video': {
    id: 25,
    pageName: '操作视频页'
  },

  'webview': {
    id: 26,
    pageName: '小程序内嵌webview'
  }
}

/************************* 页面事件id 映射关系 /s **************************/
// 首页事件映射关系
export const indexPageEventObj = {
  1: 'banner上滑',
  2: 'banner下滑',
  3: '展开表单',
  4: '收起表单',
  5: '点击跳转落地页',
  6: '联系方式输入框-授权手机号-拒绝',
  7: '个人中心-授权手机号-拒绝',
  8: '联系方式输入框-授权手机号-允许',
  9: '个人中心-授权手机号-允许',
  10: '联系方式-输入手机号码',
  11: '选择套餐-年卡',
  12: '选择套餐-季卡',
  13: '选择支架',
  14: '立即支付',
  15: '取消支付',
  16: '首页-落地页-世界长寿水源地-按钮',
  17: '首页-落地页-水类最高安全级别-按钮',
  18: '首页-落地页-地心之水-按钮',
  19: '首页-落地页-立即购买-按钮',
  20: '首页-落地页-顶部下滑',
  21: '首页-落地页-播放视频',
  22: '首页-落地页-播放视频关闭',
  23: '触发分享',
  24: '联系客服',
  25: '跳转选择地址'
}

// 支付结果页事件映射关系
export const payPageEventObj = {
  1: '填写收货信息',
  2: '赠送好友',
  3: '进入个人中心'
}

// 个人中心页面事件映射关系
export const personalPageEventObj = {
  1: '用户头像',
  2: '立即购买',
  3: '赠送好友',
  4: '未有收货信息-填写收货',
  5: '送水计划',
  6: '配送记录',
  7: '购买记录',
  8: '操作指南',
  9: '常见问题',
  10: '联系客服',
  11: '下次送水-详情',
  12: '暂停一次',
  13: '修改配送时间',
  14: '送礼记录',
  15: '优惠券',
  16: '投诉建议'
}

// 填写地址信息事件映射关系
export const addressPageEventObj = {
  1: '选择省市',
  2: '收货地址',
  3: '选中地址',
  4: '门牌号',
  5: '收货人',
  6: '联系方式',
  7: '预计送达时间',
  8: '收货地址提交',
  9: '进入个人中心',
  10: '联系客服',
  11: '预计送达时间提示弹窗',
  12: '保存并使用',
  13: '删除地址'
}

// 赠送好友事件映射关系
export const presentPageEventObj = {
  1: '选择数量-减',
  2: '选择数量-加',
  3: '选择支架',
  4: '赠送好友',
  5: '赠送记录',
  6: '立即购买',
  7: '取消分享',
  8: '确定分享'
}

// 落地页事件映射关系
export const landingPageEventObj = {
  1: '世界长寿水源地',
  2: '水类最高安全级别',
  3: '地心之水',
  4: '立即购买',
  5: '播放视频',
  6: '关闭视频',
  7: '分享'
}

// 领水页事件映射关系
export const getPresentEventObj = {
  1: '免费领取',
  2: '跳转个人中心',
  3: '分享',
  4: '回到首页'
}

// 个人资料页事件映射关系
export const userDataPageEventObj = {
  1: '更新头像',
  2: '更新昵称',
  3: '更新绑定手机',
  4: '跳转地址管理'
}

// 选择地址事件映射关系
export const addressChooseEventObj = {
  1: '跳转添加新地址',
  2: '编辑地址',
  3: '删除地址'
}

// 修改送水计划事件映射关系
export const amendplanEventObj = {
  1: '跳转选择地址',
  2: '送水时间',
  3: '送水数量选择',
  4: '保存',
  5: '启用/停止配送',
  6: '删除'
}

// 送水计划事件映射关系
export const planEventObj = {
  1: '加购支架',
  2: '临时加送',
  3: '修改计划',
  4: '查看物流',
  5: '联系客服',
  6: '滑动切换送水计划',
  7: '点击切换送水计划',
}

// 加购支架事件映射关系
export const keepEventObj = {
  1: '选择支架',
  2: '跳转选择地址',
  3: '立即支付',
  4: '取消支付'
}

// 临时加送事件映射关系
export const appointmentPageEventObj = {
  1: '选择配送数量',
  2: '选择配送时间',
  3: '备注',
  4: '确定'
}

// 赠送记录事件映射关系
export const giftHistoryPageEventObj = {
  1: '赠送中',
  2: '已转增',
  3: '已收到',
  4: '赠送中取消转增'
}

// 订单详情事件映射关系
export const lineItemPageEventObj = {
  1: '去支付',
  2: '取消订单',
  3: '进入个人中心',
  4: '复制订单号'
}

// 授权页面事件映射关系
export const loginPageEventObj = {
  1: '点击授权按钮',
  2: '允许授权',
  3: '拒绝授权'
}

// 购买记录页面事件映射关系
export const purchaseHistoryEventObj = {
  1: '跳转订单详情',
  2: '去支付'
}

// 常见问题页面事件映射关系
export const questionsEventObj = {
  1: '一级标题',
  2: '二级标题'
}

// 客服分享订单页事件映射关系
export const serviceOrderEventObj = {
  1: '提交订单',
  2: '取消支付',
  3: '微信授权',
  4: '微信授权-拒绝',
  5: '微信授权-允许',
  6: '返回首页'
}

// 配送记录页面事件映射关系
export const shipmentHistoryEventObj = {
  1: '跳转配送详情'
}

// 配送详情页面事件映射关系
export const shippingDetailsEventObj = {
  1: '复制配送单号',
  2: '进入个人中心',
  3: '取消配送',
  4: '修改配送时间',
  5: '联系物流'
}

// 修改送水时间页面事件映射关系
export const updatePlanEventObj = {
  1: '修改时间',
  2: '修改送水时间周期',
  3: '提交'
}

// 操作指南页面事件映射关系
export const videoEventObj = {
  1: '播放视频',
}
/************************* 页面事件id 映射关系 /e **************************/